app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # @users = User.paginate(page: params[:page], per_page: 5)
    @users = User.all

INSERT INTO "users" ("firstName", "lastName", "userName", "mobile", "email", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "lastName" = ?, "bio" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["lastName", "Markeshan"], ["bio", "Here is my bio"], ["updated_at", "2020-08-13 09:42:59.990015"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_param)